{
  "firstName": "Sherlock",
  "secondName": "Holmes",
  "aLittleInfo": "It is a fictional private detective created by British author Sir Arthur Conan Doyle.",
  "info": {
    "biography": "He is the fictional but brilliant detective created by Arthur Conan Doyle in 1887, created for the novel A Study In Scarlet, published in Beeton's Christmas Annual. Sherlock Holmes has essentially an obsessive personality. He works compulsively on all his cases and his deductive powers are phenomenal",
    "legacy": "Although Holmes is not the original fictional detective, his name has become synonymous with the role. Doyle's Sherlock Holmes stories introduced multiple literary devices that have become major conventions in detective fiction, such as the companion character who is not as clever as the detective and has solutions explained to him (thus informing the reader as well), as with Dr. Watson in the Holmes stories. Other conventions introduced by Doyle include the arch-criminal who is too clever for the official police to defeat, like Holmes's adversary Professor Moriarty, and the use of forensic science to solve cases. The Sherlock Holmes stories established crime fiction as a respectable genre popular with readers of all backgrounds, and Doyle's success inspired many contemporary detective stories. Holmes influenced the creation of other 'eccentric gentleman detective' characters, like Agatha Christie's fictional detective Hercule Poirot, introduced in 1920. Holmes also inspired a number of anti-hero characters 'almost as an antidote to the masterful detective', such as the gentleman thief characters A. J. Raffles (created by E. W. Hornung in 1898) and Arsène Lupin (created by Maurice Leblanc in 1905).",
    "finances": "Holmes is known to charge clients for his expenses and claim any reward offered for a problem's solution, such as in 'The Adventure of the Speckled Band', 'The Red-Headed League', and 'The Adventure of the Beryl Coronet'. The detective states at one point that 'My professional charges are upon a fixed scale. I do not vary them, save when I remit them altogether'. In this context, a client is offering to double his fee, and it is implied that wealthy clients habitually pay Holmes more than his standard rate. In 'The Adventure of the Priory School', Holmes earns a £6,000 fee (at a time where annual expenses for a rising young professional were in the area of £500). However, Watson notes that Holmes would refuse to help even the wealthy and powerful if their cases did not interest him."
  }
}
